posts/2015-05-20-working-copy.org

#+date: <2015-05-20>
#+filetags: jekyll ios
#+title: Blogging with Jekyll and Working Copy


This blog is hosted on Github, and posting from iOS has been a challenge. I'm optimistic that things have become much easier with the release of [[http://workingcopyapp.com][Working Copy]], which is a Git client for iOS that can fetch, merge, and push to both Github and Bitbucket.
 I cloned my site repository to the iPad with Working Copy, created a new Markdown file, and opened the file in [[http://bywordapp.com][Byword]] with the iOS document picker. 

In a moment, I will try to push the new file to the repository, and hope that a new post shortly appears.

UPDATE: Success! I like writing with [[http://omz-software.com/editorial/][Editorial]], but it can't use the document picker. There is an Editorial workflow for Working Copy, but I haven't tried it yet. Byword is working perfectly.


#+begin_tagline
Tagged: [[file:../tags/misc.org][Misc]]
#+end_tagline
