docs/posts/2015-05-20-working-copy.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Blogging with Jekyll and Working Copy</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Blogging with Jekyll and Working Copy</h1>
<p class="subtitle" role="doc-subtitle">May 20, 2015</p>
</header><p>
This blog is hosted on Github, and posting from iOS has been a challenge. I&rsquo;m optimistic that things have become much easier with the release of <a href="http://workingcopyapp.com">Working Copy</a>, which is a Git client for iOS that can fetch, merge, and push to both Github and Bitbucket.
 I cloned my site repository to the iPad with Working Copy, created a new Markdown file, and opened the file in <a href="http://bywordapp.com">Byword</a> with the iOS document picker. 
</p>

<p>
In a moment, I will try to push the new file to the repository, and hope that a new post shortly appears.
</p>

<p>
UPDATE: Success! I like writing with <a href="http://omz-software.com/editorial/">Editorial</a>, but it can&rsquo;t use the document picker. There is an Editorial workflow for Working Copy, but I haven&rsquo;t tried it yet. Byword is working perfectly.
</p>


<div class="tagline" id="orge32fe3a">
<p>
Tagged: <a href="../tags/misc.html">Misc</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
